computePrincipalCurvatures(Surface!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,UVUtils.UV!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*,UVUtils.UV*,System.Double(*)[N3])
Compute the principal curvatures and directions of a surface at a given point.
At an umbilic point (where the curvatures are equal), the principal directions will
be arbitrary (but still orthonormal). princCurv stores the two principal curvatures.
princDirUV stores the corresponding principal directions, expressed in the surface's
uv parameter space. princDir3d stores the (orthonormal) principal directions expressed in 3d space.
Note that princDirUV[0] and princDirUV[1] are unitized in uv space.
The three vectors {princDir3d[0], princDir3d[1], surfaceNormal} will form a right-handed frame.